import { NewEvent } from "./new_event";

describe("イベント作成", () => {
  it("イベントが正しく作成できる", () => {
    const event = new NewEvent({ name: "EventName", dates: ["2023/04/15"] });
    expect(event.name).toBe("EventName");
    expect(event.path.length).toBe(32);
  });

  it("日付が空の場合失敗する", () => {
    expect(() => {
      new NewEvent({ name: "event", dates: [] });
    }).toThrow("at least one date is required");
  });

  it("日付が20を超える場合失敗する", () => {
    expect(() => {
      new NewEvent({
        name: "20の日付",
        dates: [
          "2023/04/15",
          "2023/04/16",
          "2023/04/17",
          "2023/04/18",
          "2023/04/19",
          "2023/04/20",
          "2023/04/21",
          "2023/04/22",
          "2023/04/23",
          "2023/04/24",
          "2023/04/25",
          "2023/04/26",
          "2023/04/27",
          "2023/04/28",
          "2023/04/29",
          "2023/04/30",
          "2023/05/01",
          "2023/05/02",
          "2023/05/03",
          "2023/05/04",
        ],
      });
    }).toBeTruthy();
    expect(() => {
      new NewEvent({
        name: "21の日付",
        dates: [
          "2023/04/14",
          "2023/04/15",
          "2023/04/16",
          "2023/04/17",
          "2023/04/18",
          "2023/04/19",
          "2023/04/20",
          "2023/04/21",
          "2023/04/22",
          "2023/04/23",
          "2023/04/24",
          "2023/04/25",
          "2023/04/26",
          "2023/04/27",
          "2023/04/28",
          "2023/04/29",
          "2023/04/30",
          "2023/05/01",
          "2023/05/02",
          "2023/05/03",
          "2023/05/04",
        ],
      });
    }).toThrow("dates must be 20 num or less");
  });

  it("日付に重複があると失敗する", () => {
    expect(() => {
      new NewEvent({ name: "event", dates: ["2023/04/15", "2023/04/15"] });
    }).toThrow("duplicate date");
  });
});
